Rails/Art_Share_API/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
       if  user.save!
---
INSERT INTO "users" ("user_name") VALUES ($1) RETURNING "id"  [["user_name", "mash"]]

    def destroy
        user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]