Rails/music_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        band = Band.find_by(id: params[:id])

INSERT INTO "bands" ("name") VALUES ($1) RETURNING "id"  [["name", "enter band name.."]]
---
    def create
        @band = Band.new(band_params)

        if @band.save